Autodesk.Revit.DB.ViewOrientation3D.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewOrientation3D.ForwardDirection
The forward direction vector
Since:
2013

Autodesk.Revit.DB.ViewOrientation3D.UpDirection
The up direction vector
Since:
2013

Autodesk.Revit.DB.ViewOrientation3D.EyePosition
The eye position point
Since:
2013

Autodesk.Revit.DB.ViewOrientation3D.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
eyePosition:
The eye position
upDirection:
The up direction.  This vector will be normalized.  Up direction must be perpendicular to the forward direction.
forwardDirection:
The forward direction.  This vector will be normalized.  Forward direction must be perpendicular to the up direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or both of the input vectors cannot be normalized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
upDirection has zero length.
-or-
forwardDirection has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors upDirection and forwardDirection are not perpendicular.
Since:
2013

Autodesk.Revit.DB.ViewOrientation3D
Container for the point and vectors which define View3D's orientation.
Since:
2013